<script>
export default {
}
</script>

<template>
  <section class="order-join">
    <div class="info">회원으로 가입하시면 할인 및 적립금 등의<br>다양한 혜택을 받으실 수 있습니다. </div>
    <h3>신규회원 특별혜택</h3>

    <ul class="coupon-box">
      <li>
        <span class="percent">10%</span>
        <span class="name">신규가입 10% 할인쿠폰</span>
      </li>
      <li>
        <span class="percent">20%</span>
        <span class="name">생일쿠폰 20% 할인쿠폰</span>
      </li>
    </ul>
    <router-link
      :to="'/vue-2023/join/'"
      class="button-join"
    >회원가입</router-link>
  </section>
</template>

<style lang="scss"> 
  .order-join {
    padding: 40px 0;
    border-bottom: 1px solid #eee;
    .info {
      padding: 0 0 24px;
      text-align: center;
      font-size: 16px;
      line-height: 28px;
      font-weight: 500;
    }
    h3 {
      text-align: center;
      font-size: 18px;
      line-height: 28px;
      font-weight: 600;
    }
    .coupon-box {
      margin: 20px 0 40px;
      display: flex;
      flex-wrap: wrap;
      justify-content: center;
      gap: 56px;
      li {
        position:relative;
        span {
          display: block;
        }
        .percent {
          margin: 0 auto;
          padding: 16px 0 0 34px;
          width: 123px;
          height: 71px;
          font-size: 30px;
          line-height: 20px;
          font-weight: 700;
          background-image: url("data:image/svg+xml,%3Csvg width='123' height='71' viewBox='0 0 123 71' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M118.471 1C120.127 1 121.471 2.34314 121.471 4V23.1197C121.471 23.1262 121.47 23.1294 121.468 23.1328C121.466 23.1374 121.46 23.1469 121.448 23.1586C121.42 23.1839 121.376 23.2045 121.324 23.2045C114.81 23.2045 109.618 28.7622 109.618 35.5C109.618 42.2378 114.81 47.7955 121.324 47.7955C121.376 47.7955 121.42 47.8161 121.448 47.8414C121.451 47.8443 121.454 47.8471 121.456 47.8497C121.463 47.8575 121.466 47.8637 121.468 47.8672C121.47 47.8706 121.471 47.8738 121.471 47.8803V67C121.471 68.6569 120.127 70 118.471 70H4.11768C2.46082 70 1.11768 68.6569 1.11768 67V48.5263C1.11768 48.2056 1.45143 47.7955 2.02944 47.7955C8.54274 47.7955 13.7353 42.2378 13.7353 35.5C13.7353 28.7622 8.54274 23.2045 2.02944 23.2045C1.45143 23.2045 1.11768 22.7944 1.11768 22.4737V4C1.11768 2.34315 2.46082 1 4.11768 1H118.471Z' stroke='black' stroke-width='2'/%3E%3Crect x='26' y='8' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='16' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='24' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='32' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='40' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='48' width='1' height='5' fill='%23111111'/%3E%3Crect x='26' y='56' width='1' height='5' fill='%23111111'/%3E%3Cpath d='M43.4945 50.7031H44.6371C44.2943 48.7925 42.7899 47.6816 40.9301 47.6816C38.5687 47.6816 36.8612 49.4971 36.8676 52.4043C36.8612 55.3115 38.5687 57.127 40.9301 57.127C42.7963 57.127 44.307 55.9971 44.6371 54.1182H43.4945C43.2216 55.375 42.1425 56.0542 40.9301 56.0605C39.267 56.0542 37.9784 54.772 37.9721 52.4043C37.9784 50.0303 39.267 48.748 40.9301 48.748C42.1425 48.748 43.2279 49.4336 43.4945 50.7031ZM56.8662 52.4043C56.8726 49.4971 55.1587 47.6816 52.8037 47.6816C50.4424 47.6816 48.7349 49.4971 48.7412 52.4043C48.7349 55.3115 50.4424 57.127 52.8037 57.127C55.1587 57.127 56.8726 55.3115 56.8662 52.4043ZM49.8457 52.4043C49.8521 50.0303 51.1407 48.748 52.8037 48.748C54.4668 48.748 55.7554 50.0303 55.7618 52.4043C55.7554 54.772 54.4668 56.0542 52.8037 56.0605C51.1407 56.0542 49.8521 54.772 49.8457 52.4043ZM67.4196 47.8086V53.8008C67.4133 55.1338 66.4992 56.0923 64.9821 56.0986C63.465 56.0923 62.5383 55.1338 62.5446 53.8008V47.8086H61.402V53.8896C61.402 55.7812 62.8112 57.1587 64.9821 57.165C67.1467 57.1587 68.5622 55.7812 68.5622 53.8896V47.8086H67.4196ZM73.4534 57H74.596V53.6611H76.5892C78.7283 53.6611 79.7122 52.3599 79.7122 50.7285C79.7122 49.0908 78.7283 47.8086 76.5765 47.8086H73.4534V57ZM74.596 52.6455V48.8242H76.5257C78.0047 48.8242 78.576 49.6304 78.5823 50.7285C78.576 51.8203 78.0047 52.6455 76.5384 52.6455H74.596ZM91.9414 52.4043C91.9477 49.4971 90.2338 47.6816 87.8789 47.6816C85.5175 47.6816 83.81 49.4971 83.8164 52.4043C83.81 55.3115 85.5175 57.127 87.8789 57.127C90.2338 57.127 91.9477 55.3115 91.9414 52.4043ZM84.9209 52.4043C84.9272 50.0303 86.2158 48.748 87.8789 48.748C89.542 48.748 90.8305 50.0303 90.8369 52.4043C90.8305 54.772 89.542 56.0542 87.8789 56.0605C86.2158 56.0542 84.9272 54.772 84.9209 52.4043ZM103.777 47.8086H102.647V54.9814H102.558L97.5816 47.8086H96.4771V57H97.6197V49.8398H97.7086L102.685 57H103.777V47.8086Z' fill='%23111111'/%3E%3C/svg%3E%0A");
        }
        .name {
          margin-top: 12px;
          font-size: 14px;
          line-height: 20px;
          color: #666;
        }
        + li::before {
          content:'';
          position: absolute;
          left: -36px;
          top: 27px;
          width: 16px;
          height: 16px;
          background-repeat: no-repeat;
          background-image: url("data:image/svg+xml,%3Csvg width='16' height='16' viewBox='0 0 16 16' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Crect y='7' width='16' height='2' fill='%23111111'/%3E%3Crect x='9' width='16' height='2' transform='rotate(90 9 0)' fill='%23111111'/%3E%3C/svg%3E%0A");
        }
      }
    }
    .button-join {
      display: block;
      margin: 40px 0 0;
      padding: 12px;
      width: 100%;
      text-align: center;
      font-size: 18px;
      line-height: 30px;
      color: #fff;
      border:1px solid #111;
      background-color: #111;
    }
  }
</style>